#include <windows.h>
#include "ui/homepage.hpp"
#include <iostream>
#include <string>
#include <chrono>
#include <thread>

using namespace std;

#define RESET   "\033[0m"
#define BLUE   "\033[34m"
#define GREEN   "\033[32m"
#define CYAN    "\033[36m"
#define YELLOW  "\033[33m"
#define RED     "\033[31m"
#define BOLD    "\033[1m"


void homePage(){
    HANDLE hOut = GetStdHandle(STD_OUTPUT_HANDLE);
    SetConsoleTextAttribute(hOut, 12); // Yellow for logo

    cout << "                                                                                                                        \n";

    cout << "                                                  ██╗███████╗████████╗ █████╗ ██████╗                                        \n";
    cout << "                                                  ██║██╔════╝╚══██╔══╝██╔══██╗██╔══██╗                                       \n";
    cout << "                                                  ██║███████╗   ██║   ███████║██║  ██║                                       \n";
    cout << "                                                  ██║╚════██║   ██║   ██╔══██║██║  ██║                                       \n";
    cout << "                                                  ██║███████║   ██║   ██║  ██║██████╔╝                                       \n";
    cout << "                                                  ╚═╝╚══════╝   ╚═╝   ╚═╝  ╚═╝╚═════╝                                        \n";
     
     
    // Logo centered inside th     e box
    cout << "                          ███████╗███████╗██████╗ ██╗   ██╗███████╗    ███████╗███╗   ██╗ ██████╗ ██╗███╗   ██╗███████╗      \n";
    cout << "                          ██╔════╝██╔════╝██╔══██╗██║   ██║██╔════╝    ██╔════╝████╗  ██║██╔════╝ ██║████╗  ██║██╔════╝      \n";
    cout << "                          ███████╗█████╗  ██████╔╝██║   ██║█████╗      █████╗  ██╔██╗ ██║██║  ███╗██║██╔██╗ ██║█████╗        \n";
    cout << "                          ╚════██║██╔══╝  ██╔══██╗╚██╗ ██╔╝██╔══╝      ██╔══╝  ██║╚██╗██║██║   ██║██║██║╚██╗██║██╔══╝        \n";
    cout << "                          ███████║███████╗██║  ██║ ╚████╔╝ ███████╗    ███████╗██║ ╚████║╚██████╔╝██║██║ ╚████║███████╗      \n";
    cout << "                          ╚══════╝╚══════╝╚═╝  ╚═╝  ╚═══╝  ╚══════╝    ╚══════╝╚═╝  ╚═══╝ ╚═════╝ ╚═╝╚═╝  ╚═══╝╚══════╝      \n";

    cout << BLUE << BOLD
         << "                                      ╔════════════════════════════════════════════════════════════════╗\n";
    cout << BLUE << BOLD
         << "                                      ║                 ✨🌐 WELCOME TO SERVEENGINE ✨🌐               ║\n";

    cout << BLUE << BOLD
         << "                                      ╠════════════════════════════════════════════════════════════════╣\n";

    cout << BLUE << BOLD << "                                      ║   🧩 1. " << RESET << BLUE << BOLD "Admin Panel"
         << "                                            ║\n";
    cout << BLUE << BOLD << "                                      ║   👾 2. " << RESET << BLUE << BOLD "Staff Panel"
         << "                                            ║\n";
    cout << BLUE << BOLD << "                                      ║   🍔 3. " << RESET << BLUE << BOLD << "Menu"
         << "                                                   ║\n";
    cout << BLUE << BOLD << "                                      ║   🌀 0. " << RESET << RED << BLUE << BOLD "Exit"
         << "                                                   ║\n";

    cout << BLUE << BOLD
         << "                                      ╚════════════════════════════════════════════════════════════════╝"
         << RESET << "\n";
}

void loadingScreen()
{
     string stages[] = {
         "Initializing system",
         "Loading resources",
         "Preparing interface",
         "Almost ready"};

     for (const auto &stage : stages)
     {
          cout << "\n\t\t" << YELLOW << BOLD << stage << " " << RESET;

          for (int i = 0; i < 3; i++)
          {
               cout << "." << flush;
               Sleep(150); 
          }

          cout << " ✔️" << RESET;
     }

     cout << "\n\n\t\tReady!\n";
     system("cls");
}
